/*******************************************************************************
*                 
*                 		       威海职业学院
*					  	 信息工程系	电子创新实验室
--------------------------------------------------------------------------------
* 实 验 名		 : 时钟万年历
* 
* 实验说明       : wk_up 光标位置增加键
*				   key2 增加
*				   key1 减少
*				   key0 确认键
*******************************************************************************/
#include <stm32f10x_lib.h>
#include"delay.h"
#include"lcd1602.h"
#include"key.h"
#include"timer.h"

extern char nian1,nian2,yue,ri,shi,fen,miao;
extern char count;

/*声明变量初始化函数*/
void ValueInit(void);

/*******************************************************************************
* 函 数 名         : ValueInit();
* 函数功能		   : 定义的变量初始化
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
int main(void)
{
	Stm32ClockInit(9);			 //时钟初始化
	DelayInit(72);				 //延时初始化
	ValueInit();
	KeyInit();
	LcdInit();
	DisInit();
	TimerInit(10000,7199);		//装载值  10000为 1秒

	while(1)
	{
		KeyScan();			   //不停地检测按键
	}
}

/*******************************************************************************
* 函 数 名         : ValueInit();
* 函数功能		   : 定义的变量初始化
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void ValueInit()
{
	count = 0;
	nian1 = 0;
	nian2 = 0;
	yue = 0;
	ri = 0;
	shi = 0;
	fen = 0;
	miao = 0;
}
/******************************************************************************/
